       IDENTIFICATION DIVISION.
       PROGRAM-ID. BOUCLE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
           PERFORM 5 TIMES
           DISPLAY "Bonjour".
           STOP RUN.

     

